{
  "common": {
    "projects": [
      {
        "title": "Utel CMS",
        "url": "https://utel.edu.mx",
        "images": {
          "icon": {
            "isImage": true,
            "content": "/projects/utel-favicon.ico"
          },
          "appImage": {
            "content": "/projects/utel-app-img.png"
          }
        },
        "associatedWith": "Aerolab"
      },
      {
        "title": "Henry Website",
        "url": "https://soyhenry.com",
        "images": {
          "icon": {
            "isImage": true,
            "content": "/projects/henry-favicon.ico"
          },
          "appImage": {
            "content": "/projects/henry-app-img.png"
          }
        },
        "associatedWith": "Henry"
      },
      {
        "title": "Hangman Game",
        "url": "https://el-ahorcado.vercel.app/",
        "githubUrl": "https://github.com/tomi-mercado/el-ahorcado",
        "images": {
          "icon": {
            "isImage": false,
            "content": "😵"
          },
          "appImage": {
            "content": "/projects/hangman-app-img.png"
          }
        }
      },
      {
        "title": "Redeem App (Aerolab challenge)",
        "url": "https://redeem-app.vercel.app/",
        "githubUrl": "https://github.com/tomi-mercado/redeem-app",
        "images": {
          "icon": {
            "isImage": false,
            "content": "🎁"
          },
          "appImage": {
            "content": "/projects/redeem-app-img.png"
          }
        }
      },
      {
        "title": "Ex país",
        "url": "https://ex-pais.vercel.app",
        "githubUrl": "https://github.com/tomi-mercado/ex-pais",
        "images": {
          "icon": {
            "isImage": false,
            "content": "📉"
          },
          "appImage": {
            "content": "/projects/ex-pais-img.png"
          }
        }
      },
      {
        "title": "Crypto Things",
        "url": "https://crypto-things.vercel.app/",
        "githubUrl": "https://github.com/tomi-mercado/crypto-things",
        "images": {
          "icon": {
            "isImage": false,
            "content": "🕯️"
          },
          "appImage": {
            "content": "/projects/crypto-things-img.png"
          }
        }
      },
      {
        "title": "Typesense vector store for Langchain",
        "url": "https://js.langchain.com/docs/modules/data_connection/vectorstores/integrations/typesense",
        "githubUrl": "https://github.com/langchain-ai/langchainjs/pull/1244",
        "images": {
          "icon": {
            "isImage": false,
            "content": "🦜️"
          },
          "appImage": {
            "content": "/projects/typesense-vector-store-img.png"
          }
        }
      }
    ]
  },
  "en": {
    "main": {
      "title": "Projects",
      "description": "Get some of my projects at random to have a look at them",
      "getProject": "Get a project!",
      "getAnotherProject": "Get another project",
      "waitingProject": "Hold on to your chair, I'm picking an amazing project for you to see...",
      "notOpenSource": "Sorry, this project is not open source"
    },
    "projects": [
      {
        "description": "Utel is a Mexican online university that offers careers, courses, and master's degrees online to over 60 countries. The client needed to be able to integrate the many sites and enrollment processes into a single location.With that goal in mind, a dynamic CMS was built, which allows for quick and easy website page building, while also allowing for efficient management of the enrollment processes."
      },
      {
        "description": "Henry is a software engineering school that offers full-time and part-time courses in Latin America. The client needed a website that would showcase the company vision and their courses and allowing users to apply for the courses."
      },
      {
        "description": "Classic game of Hangman. Available only in Spanish. Use an API that generates random words. The game is responsive, and it is available for mobile devices. Counts with a dark mode."
      },
      {
        "description": "Aerolab challenge. A web application that allows users to redeem points for products. The application is responsive, and it is available for mobile devices."
      },
      {
        "description": "App to calculate the inflation of Argentina in a given period of time, based on official data. The app is responsive, and it is available for mobile devices."
      },
      {
        "description": "App to calculate your profit or loss in a given period of time, based on the price of a cryptocurrency. The app is responsive, and it is available for mobile devices."
      },
      {
        "description": "Open source contribution to Langchain, integrating Typesense as a vector store to save, update, delete and search vectors, providing a fast and scalable way to use this search engine to do a similarity search."
      }
    ]
  },
  "es": {
    "main": {
      "title": "Proyectos",
      "description": "Obten alguno de mis proyectos al azar para echarles un ojo",
      "getProject": "Ver un proyecto!",
      "getAnotherProject": "Ver otro proyecto",
      "waitingProject": "Agárrate a tu silla, estoy eligiendo un proyecto increíble para que veas...",
      "notOpenSource": "Lo siento, este proyecto no es open source"
    },
    "projects": [
      {
        "description": "Utel es una universidad en línea mexicana que ofrece carreras, cursos y maestrías en línea a más de 60 países. El cliente necesitaba poder integrar los muchos sitios y procesos de inscripción en un solo lugar. Con ese objetivo en mente, se construyó un CMS dinámico, que permite la creación rápida y fácil de páginas web, al tiempo que permite una gestión eficiente de los procesos de inscripción."
      },
      {
        "description": "Henry es una escuela de ingeniería de software que ofrece cursos de tiempo completo y parcial en América Latina. El cliente necesitaba un sitio web que mostrara la visión de la empresa y sus cursos y permitiera a los usuarios solicitar los cursos."
      },
      {
        "description": "Juego clásico del ahorcado. Disponible solo en español. Utiliza una API que genera palabras aleatorias. El juego es responsive, y está disponible para dispositivos móviles. Cuenta con un modo oscuro."
      },
      {
        "description": "Challenge de Aerolab. Una aplicación web que permite a los usuarios canjear puntos por productos. La aplicación es responsive, y está disponible para dispositivos móviles."
      },
      {
        "description": "App para calcular la inflación de Argentina en un período de tiempo determinado, basada en datos oficiales. La app es responsive, y está disponible para dispositivos móviles."
      },
      {
        "description": "App para calcular tu ganancia o pérdida en un período de tiempo determinado, basada en el precio de una criptomoneda. La app es responsive, y está disponible para dispositivos móviles."
      },
      {
        "description": "Contribución open source a Langchain, integrando Typesense como vector store para guardar, actualizar, eliminar y buscar vectores, proporcionando una forma rápida y escalable de usar este motor de búsqueda para realizar una similarity search."
      }
    ]
  }
}
